# St7GetLTASolutionType

Returns the solution type option assigned for linear transient dynamic analysis.

long St7GetLTASolutionType(long uID, long* SolutionType)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
SolutionType
Solution type; either stFullSystem or stSuperposition.

Solver – Nonlinear Transient Dynamic